//Odnosum Denys JS9_Online

// 1) Даний об'єкт з містами та країнами. Вивести масив значення в якому будуть рядки перетворені на цей формат: <Столиця> - це <Країна>.

/* {
    const citiesAndCountries = {
        'Киев': 'Украина',
        'Нью-Йорк': 'США',
        'Амстердам': 'Нидерланды',
        'Берлин': 'Германия',
        'Париж': 'Франция',
        'Лиссабон': 'Португалия',
        'Вена': 'Австрия'
    }
    for (const city in citiesAndCountries) {
        console.log(`<${city}> - це <${citiesAndCountries[city]}>`);
    }
} */

// 2)  Створити функцію яка виведе багатовимірний масив A. Даний масив містить список інших масивів B. Масиви B повинні містити по 3 значення. Та вивести його максимальне значення
/* {
    (function aBigArray(){
        const B = [4,99,12,21];
        const A = [B,B,B];
        let i = 0
        let maxNumber = B[i];
        for (const iterator of B) {
            if(iterator>maxNumber){
                maxNumber = iterator;
            } else{
                i++
            }
        }
        console.log(A);
        console.log(maxNumber);
    })();
    
} */

// 3) Створити об'єкт із назвами днів тижня. Де ключами будуть uk і en, a значенням властивості uk буде масив із назвами днів тижня українською, а en - англійською. Після написати функцію яка буде виводити в консоль назву дня тижня, користуючись вище створеним об'єктом. Усі дні тижня починаються з 1 і закінчуються цифрою 7 (1- понеділок, 7 - неділя). Функція отримує змінну lang – назву мови дня тижня та змінну day – число дня тижня.

/* {
    const dayWeek = {
        uk: [,'Понеділок','Вівторок','Середа','Четвер','П\'ятниця','Субота','Неділя'],
        en: [,'Monday','Tuesday','Wednesday','Thursday','Friday','Saturday','Sunday']
    }
    function getDayWeek(lang,day){
        console.log(dayWeek[lang][day]);
    }
    getDayWeek('en',3);//Wednesday
} */

// 4) Створіть функцію, яка повертає суму двох найменших позитивних чисел із масиву мінімум 4 позитивних цілих чисел. Не передаються числа з плаваючою комою або непозитивні цілі числа.

{
    //Вийшла якась каша. Пізніше спробую доробити. 
} 

// 5) Даний масив одиниць і нулів, перетворіть еквівалентне двійкове значення ціле число.
// Наприклад: [0, 0, 0, 1] розглядається як 0001 двійкове уявлення 1.

/* {
    arr = [0, 1, 0, 1];
    console.log(arr.join(''));
} */